app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.get_ratings

      #Set up saving sort_ratings
      if params[:ratings].nil?
        @sort_ratings = session[:ratings]
      else
        session[:ratings] = params[:ratings]
        @sort_ratings = params[:ratings]
      end

      #Set up saving sort
      if params[:sort_by].nil?
        @sort = session[:sort_by]
      else
        session[:sort_by] = params[:sort_by]
        @sort = params[:sort_by]
      end

      if @sort_ratings.nil?
        @movies = Movie.order("#{@sort}")
      else
        @movies = Movie.with_ratings(@sort_ratings.keys)
        @movies = @movies.order("#{@sort}")
---
SELECT "movies".* FROM "movies"  ORDER BY :release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R')  ORDER BY release_date